luanute/TEMPERATURE-CONTROLLER-SYSTEM-FOR-EGG-INCUBATORS/FWlib/inc/stm32f1_spi_driver.h
#ifndef INC_STM32F103_SPI_DRIVER_H_
#define INC_STM32F103_SPI_DRIVER_H_

#include "stm32f10x.h"
#include <stddef.h>
/* ================================================================== */
/* Type Definitions                             */
/* ================================================================== */

typedef SPI_TypeDef SPI_RegDef_t;

// Cấu trúc cấu hình SPI
typedef struct
{
    uint8_t SPI_DeviceMode;     // Xem @SPI_DeviceMode
    uint8_t SPI_BusConfig;      // Xem @SPI_BusConfig
    uint8_t SPI_SclkSpeed;      // Xem @SPI_SclkSpeed
    uint8_t SPI_DFF;            // Xem @SPI_DFF
    uint8_t SPI_CPOL;           // Xem @SPI_CPOL
    uint8_t SPI_CPHA;           // Xem @SPI_CPHA
    uint8_t SPI_SSM;            // Xem @SPI_SSM
} SPI_Config_t;

// Cấu trúc Handle SPI
typedef struct SPI_Handle_t
{
    SPI_RegDef_t *pSPIx;
    SPI_Config_t SPIConfig;
    uint8_t *pTxBuffer;
    uint8_t *pRxBuffer;
    uint32_t TxLen;
    uint32_t RxLen;
    uint8_t TxRxState;
} SPI_Handle_t;


/* ================================================================== */
/* Configuration Constants (#define)                    */
/* ================================================================== */

/*
 * @SPI_DeviceMode
 */
#define SPI_DEVICE_MODE_SLAVE               0
#define SPI_DEVICE_MODE_MASTER              1

/*
 * @SPI_BusConfig
 */
#define SPI_BUS_CONFIG_FD                   1 // Full-Duplex
#define SPI_BUS_CONFIG_HD                   2 // Half-Duplex
#define SPI_BUS_CONFIG_SIMPLEX_RXONLY       3 // Simplex Receive Only

/*
 * @SPI_SclkSpeed (Baud Rate Prescaler)
 */
#define SPI_SCLK_SPEED_DIV2                 0 // PCLK/2
#define SPI_SCLK_SPEED_DIV4                 1 // PCLK/4
#define SPI_SCLK_SPEED_DIV8                 2 // PCLK/8
#define SPI_SCLK_SPEED_DIV16                3 // PCLK/16
#define SPI_SCLK_SPEED_DIV32                4 // PCLK/32
#define SPI_SCLK_SPEED_DIV64                5 // PCLK/64
#define SPI_SCLK_SPEED_DIV128               6 // PCLK/128
#define SPI_SCLK_SPEED_DIV256               7 // PCLK/256

/*
 * @SPI_DFF (Data Frame Format)
 */
#define SPI_DFF_8BITS                       0 // 8-bit DFF
#define SPI_DFF_16BITS                      1 // 16-bit DFF

/*
 * @SPI_CPOL (Clock Polarity)
 */
#define SPI_CPOL_LOW                        0 // Idle Low
#define SPI_CPOL_HIGH                       1 // Idle High

/*
 * @SPI_CPHA (Clock Phase)
 */
#define SPI_CPHA_FIRST_EDGE                 0 // Capture on first edge
#define SPI_CPHA_SECOND_EDGE                1 // Capture on second edge

/*
 * @SPI_SSM (Software Slave Management)
 */
#define SPI_SSM_DI                          0 // Hardware NSS
#define SPI_SSM_EN                          1 // Software NSS


/* ================================================================== */
/* Function Prototypes (APIs)                        */
/* ================================================================== */

/* Peripheral Clock Setup */
void SPI_PeriClockControl(SPI_RegDef_t *pSPIx, uint8_t EnorDi);

/* Init and De-init */
void SPI_Init(SPI_Handle_t *pSPIHandle);
void SPI_DeInit(SPI_RegDef_t *pSPIx); // DeInit needs only peripheral pointer

/* Data Send and Receive (Blocking) */
void SPI_SendData(SPI_RegDef_t *pSPIx, uint8_t *pTxBuffer, uint32_t Len);
void SPI_ReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len);
void SPI_MasterReceiveData(SPI_RegDef_t *pSPIx, uint8_t *pRxBuffer, uint32_t Len);
// uint8_t SPI_TransferData(SPI_Handle_t *pSPIHandle, uint8_t *pTxData, uint8_t *pRxData, uint32_t Len); // Có thể thêm hàm này

/* Other Peripheral Control APIs */
void SPI_PeripheralControl(SPI_RegDef_t *pSPIx, uint8_t EnorDi);
uint8_t SPI_GetFlagStatus(SPI_RegDef_t *pSPIx, uint32_t FlagName);

#endif /* INC_STM32F103_SPI_DRIVER_H_ */

